app/views/pages/index.html.erb

			<td><%= page.name %></td>
			<td><%= page.sections.size %></td>
---
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 2