app/views/subjects/index.html.erb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1
---
			<td class="center"><%= subject.visible ? 'yes' : 'no' %></td>
			<td class="center"><%= subject.pages.size %></td>