app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
  def delete
    @page = Page.find(params[:id])

DELETE FROM `pages` WHERE `pages`.`id` = 5
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
  def destroy
    page = Page.find(params[:id]).destroy

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def edit
    @page = Page.find(params[:id])

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `permalink` = 2, `updated_at` = '2015-08-06 08:36:56' WHERE `pages`.`id` = 2
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)

SELECT `pages`.* FROM `pages`
---
  def index
    @pages = Page.all

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (1, 'created page1', 1, 1, 1, '2015-08-06 08:20:07', '2015-08-06 08:20:07')
---
  def create
    @page = Page.new(page_params)
    if @page.save

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
---
  def show
    @page = Page.find(params[:id])