app/controllers/section_controller.rb

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def delete
    @section = Section.find(params[:id])

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def edit
    @section = Section.find(params[:id])

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `page_id` = 1, `content_type` = 'string', `content` = 'asdasdadsdd', `updated_at` = '2015-08-06 09:19:20' WHERE `sections`.`id` = 1
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(section_params)

SELECT `sections`.* FROM `sections`
---
  def index
    @sections = Section.all

INSERT INTO `sections` (`page_id`, `name`, `position`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (1, 'default', 2, 'string', 'asdasdadsdd', '2015-08-06 09:26:54', '2015-08-06 09:26:54')
---
  def create
    @section = Section.new(section_params)
    if @section.save

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def show
    @section = Section.find(params[:id])