app/controllers/subjects_controller.rb

  def create
    # instantiate a new obj
    @subject = Subject.new(subject_params)
    # save the object
    if @subject.save
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('flash test', 3, 1, '2015-08-06 07:46:40', '2015-08-06 07:46:40')

  def edit
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def update
    # find obj
    @subject = Subject.find(params[:id])
    # update the object
    if @subject.update_attributes(subject_params)
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `name` = 'First e', `updated_at` = '2015-08-05 08:19:13' WHERE `subjects`.`id` = 1

  def destroy
    subject = Subject.find {params[:id]}
    subject.destroy
---
SELECT `subjects`.* FROM `subjects`
DELETE FROM `subjects` WHERE `subjects`.`id` = 1